# ==========================================
# Этап 1: Сборка (Builder)
# ==========================================
# Используем официальный образ Maven с Java 21 под капотом
FROM maven:3.9.6-eclipse-temurin-21-alpine AS builder

# Указываем рабочую директорию внутри контейнера
WORKDIR /app

# Шаг 1.1: Копируем ТОЛЬКО pom.xml
COPY pom.xml .

# Шаг 1.2: Скачиваем все зависимости
# Это хитрый трюк для кэширования. Docker запомнит этот слой.
# Если ты поменяешь код в Java-классах, Docker не будет заново скачивать пол-интернета библиотек.
RUN mvn dependency:go-offline

# Шаг 1.3: Копируем сам исходный код
COPY src ./src

# Шаг 1.4: Собираем проект, пропуская тесты
# (Тесты обычно гоняют в CI/CD пайплайнах до сборки образа)
RUN mvn clean package -DskipTests

# ==========================================
# Этап 2: Запуск (Runtime)
# ==========================================
# Берем абсолютно чистую и минималистичную версию Java (только JRE, без Maven)
FROM eclipse-temurin:21-jre-alpine

WORKDIR /app

# БЕЗОПАСНОСТЬ (Best Practice): Создаем непривилегированного пользователя
# Запускать приложения от имени root в Docker крайне опасно.
RUN addgroup -S appgroup && adduser -S appuser -G appgroup
USER appuser:appgroup

# Копируем ГОТОВЫЙ .jar файл из первого этапа (builder)
# Файловая система Maven (скачанные библиотеки, исходники) сюда не попадет!
COPY --from=builder /app/target/*.jar app.jar

# Говорим Докеру, что контейнер будет слушать порт 8080
EXPOSE 8080

# Команда, которая выполнится при старте контейнера
ENTRYPOINT ["java", "-jar", "app.jar"]